* Can I output a table that is auto expanded?
  e.g. output

| foo | bar |
|-
| baz

and get this

| foo | bar |
|-----+-----|
| baz |     |

without a manual org cyle

#+begin_src shell  :results raw replace :wrap :cache no :exports results
  exec 2>&1;set -e; set -u; set +x; echo '#' `date;`
  echo '|foo|bar|' '
' '|baz'



#+end_src

#+RESULTS:
#+BEGIN_RESULTS
# Sun Nov 27 07:50:50 EST 2016
| foo | bar |
|-----+-----|
| baz |     |
#+END_RESULTS



